import 'package:flutter/material.dart';

class ach extends StatelessWidget {
  const ach({super.key});
  @override
  Widget build(BuildContext context) {
    return Scaffold( 
      appBar: AppBar(title: Text("انجازات محمد صلاح ",style: TextStyle(color:  Colors.red,fontSize: 15,fontWeight: FontWeight.bold),),centerTitle: true,backgroundColor: Colors.black,elevation: 20,shadowColor: Colors.black,),
        body: Container(
          width: double.infinity,
          height:double.infinity ,
            color: Colors.black,
           child: SingleChildScrollView(
              child: 
                Column(
                   children: [
                    SizedBox(
                      width: 470,
                      height: 380,
                    child: 
                    Image.asset("images/Mo_Salah_in_UEFA_Super_Cup_2019.jpg"),
                    ),
                    SizedBox(height: 20,),
                  
                  Directionality(
  textDirection: TextDirection.rtl,child:   Text("""الإنجازات
  النادي
سويسرا بازل

دوري السوبر السويسري: 2012–13، 2013–14.
إنجلترا ليفربول

الدوري الإنجليزي الممتاز: 2019–20، 2024–25.
كأس الاتحاد الإنجليزي: 2021–22.
كأس رابطة الأندية الإنجليزية المحترفة: 2021–22، 2023–24.
درع الاتحاد الإنجليزي: 2022.
دوري أبطال أوروبا: 2018–19؛ الوصيف: 2017–18،2021–22.
كأس السوبر الأوروبي: 2019.
كأس العالم للأندية: 2019.
المنتخب
مصر مصر تحت 20

كأس الأمم الأفريقية تحت 20 سنة المركز الثالث: 2011.
مصر مصر

كأس الأمم الأفريقية الوصيف: 2017، 2021.
الفردية
جائزة أفضل لاعب صاعد في أفريقيا: 2012.
جائزة أفضل لاعب في دوري السوبر السويسري: 2013.
جائزة هداف تصفيات أفريقيا لكأس العالم 2014: 6 أهداف (بالمشاركة مع أسامواه جيان ومحمد أبو تريكة).
جائزة لاعب الموسم في نادي روما: 2015–16.
جائزة صحيفة الهداف لأفضل لاعب عربي: 2013، 2017، 2018.
جائزة أفضل لاعب عربي من غلوب سوكر: 2016.
تشكيلة العام من الكاف: 2017، 2018، 2019، 2023.
كأس الأمم الأفريقية (فريق البطولة): 2017، 2021.
جائزة الأسد الذهبي لأفضل لاعب في أفريقيا: 2017.
جائزة بي بي سي لأفضل لاعب كرة قدم أفريقي: 2017، 2018.
جائزة أفضل لاعب أفريقي خلال العام: 2017 2018.
جائزة لاعب الشهر في الدوري الإنجليزي الممتاز (رابطة اللاعبين المحترفين): نوفمبر 2017، ديسمبر 2017، فبراير 2018، مارس 2018، ديسمبر 2018، يناير 2019، أبريل 2019، سبتمبر 2021، أكتوبر 2021، فبراير 2022، سبتمبر 2023،
جائزة لاعب الشهر في الدوري الإنجليزي الممتاز (إي أيه سبورتس): نوفمبر 2017، فبراير 2018، مارس 2018،أكتوبر 2021، أكتوبر 2023، نوفمبر 2024، فبراير 2025.
جائزة أفضل لاعب عربي من موقع جول النسخة العربية: 2017، 2018، 2019، 2020، 2021.
جائزة أفضل لاعب في إنجلترا: 2017–18،2021–22 ،2024–25 .
جائزة أفضل لاعب في إنجلترا من اتحاد كتاب كرة القدم: 2017–18، 2021–22.
جائزة الحذاء الذهبي في الدوري الإنجليزي الممتاز: 2017–18، 2018–19 (مناصفة)، 2021–22 (مناصفة)،2024–25
أفضل ممرر في الدوري الإنجليزي الممتاز: 2021–22،2024–25
جائزة هدف الموسم في الدوري الإنجليزي الممتاز: 2021–22.
جائزة لاعب الأسبوع في دوري أبطال أوروبا: 15 سبتمبر 2017، 20 أكتوبر 2017، 6 أبريل 2018، 27 أبريل 2018.
جائزة هدف الأسبوع في دوري أبطال أوروبا: 16 أبريل 2018، 7 مايو 2018.
جائزة لاعب الشهر «POTM» في نادي ليفربول: أغسطس 2017، سبتمبر 2017، نوفمبر 2017، ديسمبر 2017، فبراير 2018، مارس 2018، أبريل 2018.
جائزة هدف الشهر «GOTM» في نادي ليفربول: أغسطس 2017، سبتمبر 2017، نوفمبر 2017، ديسمبر 2017، فبراير 2018، أبريل 2018.
جائزة BristolStMotors المقدمة من رابطة اللاعبين المحترفين الإنجليزية، بتصويت الجماهير مايو 2018.
جائزة لاعب الموسم في الدوري الإنجليزي الممتاز: 2017–18.
جائزة لاعب الموسم في ليفربول،، بتصويت الجماهير: 2017–18، 2020–21، 2021–22.
جائزة أفضل لاعب في ليفربول: 2017–18، 2020–21. 2021–22.
جائزة أفضل لاعب في الموسم بالدوري الإنجليزي الممتاز المقدمة من رابطة اللاعبين المحترفين، بتصويت الجماهير: 2017–18، 2020–21.
جائزة الاتحاد الأوروبي لكرة القدم: (فريق الموسم) 2017–18.
جائزة وسائل الإعلام الرياضية الأوروبية: 2017–18.
جائزة أونز الذهبية: 2017–18.
جوائز الفيفا للأفضل كرويا: (المركز الثالث) 2018، 2021.
الفريق المثالي الأفضل في إفريقيا: 2017، 2018.
قائمة الـ 100 شخصية الأكثر تأثيرا في أفريقيا حسب مجلة نيو أفريكان: 2018.
المواطن الفخري لجمهورية الشيشان: 2018.
جائزة أفضل لاعب في أوروبا: (المركز الثالث) 2017–18.
جائزة بوشكاش لأفضل هدف: 2018.
فيفبرو التشكيلة الثانية: 2018.
جائزة قول 50: (المركز الثالث) 2018.
الكرة الذهبية في كأس العالم للأندية: 2019.
جائزة لاعب العام من اتحاد مشجعي كرة القدم: 2018، 2021.
جائزة الكرة الذهبية: (المركز السادس) 2018.
تايم 100: 2019.
هدف الموسم في ليفربول: 2018–19 (ضد نادي تشيلسي)،2021–22 (ضد نادي مانشستر سيتي).
جائزة رجل العام من نسخة الشرق الأوسط لمجلة جي كيو: 2019.
جائزة لاعب العام المقدمة من قبل مشجعي كرة القدم:2020، 2021.
جزء من التشكيل المثالي الأفريقي المقدمة من الاتحاد الدولي لتاريخ وإحصاءات كرة القدم: 2020، 2021.
جزء من التشكيل المثالي الأفريقي لعقد 2011–2020 المقدمة من الاتحاد الدولي لتاريخ وإحصاءات كرة القدم.
جائزة لوريوس العالمية للإلهام الرياضي: 2021.
جائزة القدم الذهبية: 2021.
جائزة أفضل لاعب في قارة أفريقيا المقدمة من الاتحاد الدولي لتاريخ وإحصاءات كرة القدم: 2021.
جائزة أفضل لاعب في الدوري الإنجليزي الممتاز المقدمة من بي بي سي: 2021.


""",style:TextStyle(height: 2.1,color: Colors.white,fontSize: 16,fontWeight: FontWeight.w300),),),
                   
                   ],

                ),
                ),
        ),
        );
  }
}