import 'package:flutter/material.dart';

class bazel extends StatelessWidget {
  const bazel({super.key});
  @override
  Widget build(BuildContext context) {
    return Scaffold( 
      appBar: AppBar(title: Text("محمد صلاح في بازل",style: TextStyle(color:  Colors.red,fontSize: 15,fontWeight: FontWeight.bold),),centerTitle: true,backgroundColor: Colors.black,elevation: 20,shadowColor: Colors.black,),
        body: Container(
          width: double.infinity,
          height:double.infinity ,
            color: Colors.black,
           child: SingleChildScrollView(
              child: 
                Column(
                   children: [
                    Image.asset("images/Zenit-bazel_2013_(2).jpg"),
                    SizedBox(height: 20,),
                  
                  Directionality(
  textDirection: TextDirection.rtl,child:   Text("""في عام 2012 وبعد مستواه اللافت مع نادي المقاولون العرب، أتم بازل السويسري تعاقده مع صلاح في أبريل 2012 في الصفقة التي بلغت مليوني يورو حيث تابعه نادي بازل السويسري لبعض الوقت، وبعد أحداث كارثة ستاد بورسعيد قام بازل بترتيب مباراة ودية مع منتخب مصر تحت 23 سنة. أقيم اللقاء في 16 مارس 2012 بإستاد رانكوف في بازل. لم يشارك محمد صلاح إلا في الشوط الثاني فقط، لكنه سجل هدفين، وانتهت المباراة بفوز بازل بنتيجة 4–3. بعد اللقاء، دعى نادي بازل محمد صلاح ليتدرب مع الفريق الأول لمدة أسبوع، وفي 10 أبريل 2012، وقع محمد صلاح لنادي بازل السويسري، بعقد لمدة أربع سنوات ابتداءً من 15 يونيو 2012. وانتقل محمد صلاح إلى صفوف بازل السويسري في صفقة قياسية بالنسبة لنادى المقاولون العرب، حيث بلغت قيمة الصفقة 2 مليون يورو، بالإضافة إلى احتفاظ النادي المصري بنسبة إذا ما قرر بازل بيعه بالمستقبل.

لم يبدأ محمد صلاح مشاركاته مع بازل أساسياً، وإنما بدأها من مقاعد البدلاء، ففي 23 يونيو 2012 شارك في مباراة ضد ستيوا بوخارست الروماني في المباراة التي انتهت بهزيمة بازل 4–2. ثم لعب أول مباراة رسمية مع بازل في الدور التمهيدي من بطولة دوري أبطال أوروبا، ضد نادي مولده النرويجي في يوم 8 أغسطس 2012، ودخل بديلاً في الدقيقة 74. لم ينتظر محمد صلاح طويلاً ليسجل أول أهدافه في الدوري السويسري، ففي الأسبوع الثاني من منافسات الدوري، وأمام نادي لوزان سجل محمد صلاح الهدف الأول له والثاني لفريقه، مؤكداً فوز بازل باللقاء بنتيجة 2–0. استمر محمد صلاح بالتسجيل، لكن هذه المرة كان في الدور الربع النهائي من بطولة الدوري الأوروبي ففي 11 أبريل عام 2013، سجل أول أهدافه الأوروبية ضد توتنهام هوتسبير، ليتأهل فريقه بازل للدور المقبل بعدما تخطوا توتنهام هوتسبير بركلات الترجيح بعد التعادل 4–4 في مجموع المباراتين. وفي الدور نصف النهائي من بطولة الدوري الأوروبي، سجل محمد صلاح ضد تشيلسي على ملعب ستامفورد بريدج، ولكن بازل تعرضت للخسارة 2–5 في مجموع المباراتين. على الرغم من خيبة الأمل في المنافسات الأوروبية، فاز بازل بموسم 2012–13 من الدوري السويسري، وحل وصيفاً في مسابقة كأس سويسرا. أصبح محمد صلاح محل اهتمام الصحف المصرية والعالمية، بعد مشاركته في بطولة دوري أوروبا، وتسجيله هدفين في مرمى كلا من توتنهام هوتسبير وتشيلسي الإنجليزيين. حصل محمد صلاح على لقب أفضل لاعب في الدوري السويسري عن عام 2013، كما حصل على جائزة الاتحاد الأفريقي لكرة القدم لأفضل لاعب صاعد في أفريقيا عام 2012.

موسم 2013–14
مع بداية موسم 2013–14، سجل محمد صلاح في أول ظهور ضد آرو في 13 يوليو 2013. وسجل أول هدف له في دوري أبطال أوروبا بعد شهر ضد نادي مكابي تل أبيب في الدور الثالث من التصفيات المؤهلة لدوري أبطال أوروبا. ثم سجل هدفين في مرمى بطل الدوري البلغاري الممتاز نادي لودوجوريتس رازجراد في الدور الفاصل. في 18 سبتمبر 2013، سجل محمد صلاح هدف التعادل ضد تشلسي في المباراة التي انتهت بفوز فريقه 2–1، على ملعب ستامفورد بريدج بالعاصمة الإنجليزية لندن. خلال مرحلة الإياب من دور المجموعات في دوري أبطال أوروبا، وتحديداً في 26 نوفمبر وعلى سانت جاكوب بارك، أكد صلاح موهبته وسجل مرة أخرى هدف الفوز الوحيد، ليفوز نادي بازل للمرة الثانية على نادي تشلسي. إجمالًا، قضى صلاح مع نادي بازل موسما ونصف خاض خلالها 79 مباراة محرزاً 20 هدفاً في مختلف البطولات.

""",style:TextStyle(height: 2.1,color: Colors.white,fontSize: 16,fontWeight: FontWeight.w300),),),
                   
                   ],

                ),
                ),
        ),
        );
  }
}