import 'package:flutter/material.dart';

class chelse extends StatelessWidget {
  const chelse({super.key});
  @override
  Widget build(BuildContext context) {
    return Scaffold( 
      appBar: AppBar(title: Text("محمد صلاح في تشيلسي",style: TextStyle(color:  Colors.red,fontSize: 15,fontWeight: FontWeight.bold),),centerTitle: true,backgroundColor: Colors.black,elevation: 20,shadowColor: Colors.black,),
        body: Container(
          width: double.infinity,
          height:double.infinity ,
            color: Colors.black,
           child: SingleChildScrollView(
              child: 
                Column(
                   children: [
                    SizedBox(
                      width: 470,
                      height: 380,
                    child: 
                    Image.asset("images/Mohamed_Salah_with_Chelsea_-_Jan_2015.jpg"),
                    ),
                    SizedBox(height: 20,),
                  
                  Directionality(
  textDirection: TextDirection.rtl,child:   Text("""
تشيلسي
موسم 2013–14للمرة الثانية، صلاح بين عدة عروض أكثرهم جدية من ناديي تشيلسي وليفربول الإنجليزيين، وعلى عكس رغبة جميع متابعيه، جاء اختيار صلاح اللعب لأصحاب القميص الأزرق، ليكون أول مصري ينضم إلى نادي تشيلسي بينما كان يفضل جمهوره أن يذهب صلاح إلى نادي أقل من تشيلسي، لتكون فرصة اللعب أفضل. وفي 26 يناير 2014، أعلن نادي تشيلسي عن إتمام صفقة انتقال محمد صلاح إلى النادي اللندني، بصفقة لم يعلَن عنها، لكن قدرتها الصحافة الإنجليزية بما يقارب 11 مليون جنيه إسترليني أي ما يعادل 13.25 مليون يورو، واستطاع خطفه من نادي ليفربول الذي تفاوض معه لمدة تزيد عن شهرين. وفي 8 فبراير 2014 سجل صلاح ظهوره الأول مع تشيلسي حيث حل بديلًا في مباراة الفوز 3–0 على نيوكاسل يونايتد، وأحرز صلاح أول أهدافه مع فريق تشيلسي في مباراة أرسنال التي انتهت بنتيجة 6–0 لصالح تشيلسي على ملعب ستامفورد بريدج. وفي 5 أبريل 2014 افتتح صلاح التسجيل ثم حصل على ضربة جزاء أتى عن طريقها الهدف الثاني ثم قام بصناعة الهدف الثالث في فوز فريقه على ستوك سيتي بنتيجة 3–0، ولكن لم يجد صلاح فرصة للمشاركة كأساسي مع تشيلسي حيث شارك في بعض المباريات فقط وكان يشارك كبديلاً ولفترات قليلة جداً.

موسم 2014–15
في بداية الموسم بدت أوضاع صلاح غير مستقرة بعد أن قام بتقديم طلب للانتساب لأحد المعاهد الدراسية ليستكمل تعليمه ووافق وزير التعليم العالي المصري على ذلك ثم فوجئ صلاح بعد ذلك بتراجع الوزير عن قراره وقام بإلغاء انتساب محمد صلاح للمعهد بداعي عدم حصوله على الدرجات المطلوبة للالتحاق بالمعهد بالإضافة إلى عدم حضوره، وبذلك أصبح صلاح لا ينتسب لأي جامعة أو معهد وبالتالي أصبح مطلوباً للتجنيد لذلك ترددت أخبار بأنه مضطر أن يترك تشيلسي ويعود إلى مصر لتأدية الخدمة العسكرية، ولكن حُلَّت الأزمة عن طريق اجتماع مدرب المنتخب المصري في ذلك الحين شوقي غريب مع رئيس الوزراء المصري آنذاك إبراهيم محلب مع وزير التعليم العالي المصري.

في موسم صلاح الثاني مع تشيلسي قام اللاعب بتغيير قميصه من الرقم 15 إلى 17 بعد أن أصبح رقمه الأخير شاغراً بعد أن تركه اللاعب البلجيكي إدين هازارد ليرتدي الرقم 10، ولم يختلف موسم صلاح الثاني كثيراً عن الموسم الأول حيث شارك في ثلاث مباريات فقط طوال الموسم كان أولها يوم 13 سبتمبر 2014 ضد سوانزي سيتي حيث شارك في الدقائق الثمانية الأخيرة فقط كبديل للاعب الإسباني سيسك فابريغاس.



""",style:TextStyle(height: 2.1,color: Colors.white,fontSize: 16,fontWeight: FontWeight.w300),),),
                   
                   ],

                ),
                ),
        ),
        );
  }
}