import 'package:flutter/material.dart';

class fyorintina extends StatelessWidget {
  const fyorintina({super.key});
  @override
  Widget build(BuildContext context) {
    return Scaffold( 
      appBar: AppBar(title: Text("محمد صلاح في فيورينتينا",style: TextStyle(color:  Colors.red,fontSize: 15,fontWeight: FontWeight.bold),),centerTitle: true,backgroundColor: Colors.black,elevation: 20,shadowColor: Colors.black,),
        body: Container(
          width: double.infinity,
          height:double.infinity ,
            color: Colors.black,
           child: SingleChildScrollView(
              child: 
                Column(
                   children: [
                    Image.asset("images/Mohamed_Salah_2015.jpg"),
                    SizedBox(height: 20,),
                  
                  Directionality(
  textDirection: TextDirection.rtl,child:   Text("""فيورنتينا (إعارة)
  لم تكن أوضاع صلاح في تشيلسي مرضية لطموحه ولا لجمهوره، فقد لازم دكة البدلاء لفترات طويلة لم يعتدها صلاح في مسيرته، لذا كان قراره بالرحيل، وفي يوم 3 فبراير 2015، انتقل محمد صلاح إلى نادي فيورنتينا الإيطالي على سبيل الإعارة لمدة ستة أشهر على أن يكون للنادي الحق في التجديد لموسم آخر، ويعتبر هذا الانتقال جزءاً من صفقة انتقال كوادرادو إلى تشيلسي. وقد شارك صلاح لأول مرة أمام أتلانتا في 8 فبراير 2015 في المباراة التي فازت فيها فيرونتينا 3–2، أحرز صلاح أول أهدافه مع فيورينتينا في مباراتهم ضد ساسولو والتي انتهت بفوز فيورنتينا بنتيجة 3–1. وكانت هي المباراة الثانية له والأولى كأساسي وفيها أحرز الهدف الأول وصنع الهدف الثاني. وسجل الهدف الثاني مع الفريق ضد تورينو بعد أن دخل بديل في دقيقة 66 وكان نتيجة التعادل السلبي فأحرز هدف التقدم لفريقه بدقيقة 85 وبعد دقيقتين عادل النتيجة الفريق الآخر لتنتهي 1–1. ولعب بديلًا ضد إنتر ميلان وتمكن من تسجيل الهدف الوحيد في المباراة ومنح فريقه الثلاث نقاط. وفي الدوري الأوروبي لعب محمد صلاح ذهاب وإياب دور ال16 أساسيًا ضد توتنهام وسجل الهدف الثاني في مباراة الإياب ليؤكد عبور فيورنتينا لدور الثمانية بنتيجة 3–1 في مجموع المباراتين. وفي أولى مبارياته في كأس إيطاليا، وتحديدًا في الدور نصف النهائي أمام يوفنتوس، أحرز محمد صلاح هدفين لفريقه لتنتهي المباراة بفوزهم بنتيجة 2–1. وأتت خسارة اليوفنتوس بأقدام صلاح بعد 47 مباراة متتالية على ملعبهم دون خسارة، كما أنه أول لاعب يحرز هدفين في شباك يوفنتوس في موسم 2014–15. ثم بعد مباراة مصر ضد غينيا الاستوائية الودية عاد محمد صلاح إلى ناديه وواصل التألق بإحراز الهدف الثاني في مرمى فريق سامبدوريا في الدوري الإيطالي، ولعب محمد صلاح مباراة الذهاب من نصف نهائي الدوري الأوروبي وفي هذه المباراة فاز فيورنتينا 0–2 وقدم صلاح أداء مميز في هذه المباراة ولعب لقاء إشبيلية وخسر الفريق 0–3 ورغم هذا اختير صلاح في التشكيلة المثالية.
""",style:TextStyle(height: 2.1,color: Colors.white,fontSize: 16,fontWeight: FontWeight.w300),),),
                   
                   ],

                ),
                ),
        ),
        );
  }
}