import 'package:flutter/material.dart';

class goodnumbers extends StatelessWidget {
  const goodnumbers({super.key});
  @override
  Widget build(BuildContext context) {
    return Scaffold( 
      appBar: AppBar(title: Text("الأرقام القياسية",style: TextStyle(color:  Colors.red,fontSize: 15,fontWeight: FontWeight.bold),),centerTitle: true,backgroundColor: Colors.black,elevation: 20,shadowColor: Colors.black,),
        body: Container(
          width: double.infinity,
          height:double.infinity ,
            color: Colors.black,
           child: SingleChildScrollView(
              child: 
                Column(
                   children: [
                    SizedBox(
                      width: 470,
                      height: 380,
                    child: 
                    Image.asset("images/LFC_Parade_2019_03.jpg"),
                    ),
                    SizedBox(height: 20,),
                  
                  Directionality(
  textDirection: TextDirection.rtl,child:   Text("""الأرقام القياسية
أوروبا
أسرع ثلاثية (هاتريك) في مباراة بدوري أبطال أوروبا: 6 دقائق و12 ثانية ضد رينجرز، 12 أكتوبر 2022.
أكبر عدد من الأهداف في دوري أبطال أوروبا لنادٍ إنجليزي: 41 هدفاً لليفربول.
أسرع ثلاثية في دوري أبطال أوروبا لبديل: 13 دقيقة ضد رينجرز، 12 أكتوبر 2022.
أكبر عدد من الأهداف المسجلة في مسابقات الأندية الأوروبية بواسطة لاعب أفريقي: 53 هدفاً.
أقل عدد من اللمسات على الإطلاق لتسجيل ثلاثية في مباراة في دوري أبطال أوروبا: 9 لمسات.
أفضل هداف أفريقي على الإطلاق في تاريخ دوري أبطال أوروبا: 44 هدفًا.
إنجلترا

أكثر من سجل أهداف في موسم واحد في الدوري الإنجليزي (38 جولة): 32 هدف في 2017–18.
أكثر من سجل في مباريات مختلفة بموسم واحد في الدوري الإنجليزي: 24 مباراة مختلفة في 2017–18.
أكثر لاعب أفريقي سجل أهداف في موسم واحد في الدوري الإنجليزي: 32 هدف في 2017–18.
أكثر من فاز بجائزة لاعب الشهر في الدوري الإنجليزي في موسم واحد: 3 مرات (نوفمبر 2017، فبراير 2018 ومارس 2018).
أكثر من سجل أهداف بالقدم اليسرى في موسم واحد في الدوري الإنجليزي: 25 هدف في 2017–18.
أكثر لاعب سجل في فرق مختلفة في موسم واحد في الدوري الإنجليزي: 17 فريق (بالتشارك مع إيان رايت وروبين فان بيرسي).
أول لاعب يسجل أهداف أكثر من ثلاثة فرق بالدوري الإنجليزي: وست بروميتش (31) وسوانزي سيتي (28) وهدرسفيلد تاون (28) في 2017–18.
أول لاعب في تاريخ الدوري الإنجليزي يسجل في افتتاحية ست مواسم متتالية (2017–18 إلى 2022–23).
اللاعب الأفريقي الأعلى تسجيلاً للأهداف في تاريخ الدوري الإنجليزي: 190 هدفًا.
ليفربول

أكثر لاعب سجل أهداف في أول موسم له: 44 هدف في 2017–18.
أكثر لاعب سجل أهداف في موسم واحد في البطولات الأوروبية: 11 هدف في 2017–18 (بالتشارك مع روبرتو فيرمينو).
أكثر لاعب سجل أهداف في موسم واحد في عصر الدوري الإنجليزي الممتاز: 44 هدف في 2017–18.
أكثر لاعب سجل في مباريات منفصلة في موسم واحد: 34 مباراة في موسم 2017–18.
أكثر لاعب سجل أهداف في موسم واحد: 32 هدف في الدوري الإنجليزي الممتاز 2017–18 (بالتشارك مع إيان راش).
أكثر لاعب حقق جائزة أفضل لاعب في ليفربول خلال موسم واحد: 7 أشهر في 2017–18.
أسرع لاعب يسجل 50 هدف مع ليفربول: خلال 65 مباراة في 2018–19.
أسرع لاعب يسجل 50 هدف مع ليفربول في الدوري الإنجليزي: خلال 69 مباراة في 2018–19.
أكثر من سجل في أول 100 مباراة في كل المسابقات مع ليفربول عبر التاريخ: 69 هدف.
أكثر من سجل في أول 100 مباراة بالدوري الإنجليزي في تاريخ ليفربول: 70 هدفاً
الهداف التاريخي لليفربول في دوري أبطال أوروبا 46 هدفاً.
أول لاعب في ليفربول يسجل 20 هدفاً على الأقل في خمس مواسم مختلفة من الدوري الإنجليزي الممتاز: 2017–18، 2018–19، 2020–21، 2021–22، 2024-25.
أسرع لاعب يسجل الهدف رقم 100 في تاريخ ليفربول: 151 مباراة.
ثاني أسرع لاعب يسجل الهدف رقم 150 في تاريخ ليفربول: 233 مباراة.
ثاني أسرع لاعب يسجل الهدف رقم 200 في تاريخ ليفربول: 327 مباراة.
ثالث أسرع لاعب يسجل الهدف رقم 250 في تاريخ ليفربول: 415 مباراة.
أكثر لاعب سجل أهداف في عدد من المباريات المتتالية: 10 مباريات في 2021–22.
أكثر لاعبي ليفربول صناعةً للأهداف في الدوري الإنجليزي الممتاز (92 تمريرة حاسمة، معادلًا رقم ستيفن جيرارد) حتى عام 2026.
مصر

أكثر لاعب تسجيلاً للأهداف مع مصر في كأس العالم: هدفين في كأس العالم 2018 (بالتشارك مع عبد الرحمن فوزي؛ هدفان في كأس العالم 1934).
أفضل هداف في تاريخ مصر في تصفيات كأس الأمم الأفريقية: 14 هدف.
ثاني هدافي مصر عبر التاريخ: 60 هدف (خلف حسام حسن 69 هدف).
إيطاليا

أكثر لاعب مصري تسجيلاً للأهداف في تاريخ الدوري الإيطالي: 35 هدف في 81 مباراة



""",style:TextStyle(height: 2.1,color: Colors.white,fontSize: 16,fontWeight: FontWeight.w300),),),
                   
                   ],

                ),
                ),
        ),
        );
  }
}