import 'package:flutter/material.dart';

class masera extends StatelessWidget {
  const masera({super.key});
  @override
  Widget build(BuildContext context) {
    return Scaffold( 
      appBar: AppBar(title: Text("المسيره الدولية لمحمد صلاح",style: TextStyle(color:  Colors.red,fontSize: 15,fontWeight: FontWeight.bold),),centerTitle: true,backgroundColor: Colors.black,elevation: 20,shadowColor: Colors.black,),
        body: Container(
          width: double.infinity,
          height:double.infinity ,
            color: Colors.black,
           child: SingleChildScrollView(
              child: 
                Column(
                   children: [
                    SizedBox(
                      width: 470,
                      height: 380,
                    child: 
                    Image.asset("images/Egypt_against_Tunisia_2012.jpg"),
                    ),
                    SizedBox(height: 20,),
                  
                  Directionality(
  textDirection: TextDirection.rtl,child:   Text("""منتخب مصر للشباب
لعب محمد صلاح مع منتخب مصر للشباب في كأس العالم للشباب 2011، في كولومبيا مع العديد من اللاعبين الذين صاروا نجوماً بعد ذلك مثل: أحمد حجازي لاعب ويست بروميتش ألبيون حاليًا، ومحمد النني لاعب أرسنال وعمر جابر لاعب بازل السويسري ومحمد إبراهيم لاعب الزمالك وأحمد الشناوي حارس مرمى الزمالك، ونجح المنتخب المصري في تلك البطولة في الوصول إلى دور الستة عشر، حيث ضمت مجموعته كلاً من منتخب البرازيل ومنتخب النمسا ومنتخب بنما، ونجح منتخب مصر في التعادل مع البرازيل 1–1 بهدف عمر جابر والفوز على بنما 1–0 بهدف أحمد حجازي والفوز على النمسا 4–0 بثلاثية لمحمد إبراهيم وهدف للاعب محمد غازي، وتأهل المنتخب المصري إلى دور الستة عشر في المركز الثاني بفارق الأهداف عن المنتخب البرازيلي الذي تساوى معه في عدد النقاط حيث حصد كل منهما 7 نقاط من فوزين وتعادل، وفي دور الستة عشر تلاقي المنتخب المصري مع منتخب الأرجنتين ونجح محمد صلاح في إحراز هدف من ضربة جزاء في تلك المباراة التي انتهت بهزيمة المنتخب المصري بنتيجة 2–1 وخروجه من البطولة. وفي العموم شارك صلاح مع منتخب الشباب في 11 مباراة سجل خلالها 3 أهداف.
منتخب مصر الأولمبي
كان صلاح جزءًا من المنتخب الأوليمبي المصري في أولمبياد لندن 2012، وفيها وقع المنتخب المصري في المجموعة الثالثة بجانب كل من البرازيل وروسيا البيضاء ونيوزيلندا، وفي مباراته الأولي على ملعب الألفية تلقي المنتخب المصري الهزيمة من منتخب البرازيل بنتيجة 3–2 ونجح صلاح في هز شباك المنتخب البرازيلي الأوليمبي بإحرازه للهدف الثاني بعد أن سجل محمد أبو تريكة الهدف الأول، وفي المباراة الثانية على ملعب أولد ترافورد الشهير سجل صلاح أيضاً في التعادل مع نيوزيلندا بنتيجة 1–1، وعلى ملعب هامبدن بارك سجل صلاح مرة ثالثة في الفوز على روسيا البيضاء نتيجة 3–1 وأحرز الهدفين الآخرين مروان محسن لاعب الأهلي الحالي ومحمد أبو تريكة، وبذلك يكون صلاح قد سجل في جميع مباريات الفريق في دور المجموعات، وفي المباراة التالية في دور ربع النهائي تلقى المنتخب المصري الهزيمة من منتخب اليابان بنتيجة 3–0 ليودع البطولة.

وإجمالًا شارك صلاح مع المنتخب الأوليمبي في 11 مباراة سجل فيها 4 أهداف

منتخب مصر الأول
أصبح من نجوم المنتخب المصري الأول، منذ مشاركته في مباراته الدولية الأولى ضد سيراليون في التصفيات المؤهلة لكأس الأمم الإفريقية 2013، ثم أحرز أول أهدافه مع المنتخب المصري في مرمى النيجر، كما أحرز أول هاتريك دولي له في مرمى زيمبابوي، وشارك مع المنتخب في التصفيات المؤهلة لكأس الأمم الإفريقية 2015 ولم ينجح المنتخب في الوصول إليها وشارك أيضاً في التصفيات المؤهلة لكأس العالم 2014 ولم ينجح المنتخب أيضاً في الوصول إليه ولكن صلاح حصل على لقب هداف تلك التصفيات بستة أهداف بالاشتراك مع زميله محمد أبو تريكة واللاعب الغاني أسامواه جيان، كما ساهم صلاح في وصول منتخب بلاده إلى كأس الأمم الإفريقية 2017 بإحرازه لهدف في مرمى نيجيريا في المباراة التي انتهت بالتعادل 1–1 حيث ساهم الهدف بشدة في وصول منتخب مصر إلى البطولة بعد فوزه على نيجيريا في مباراة العودة 1–0 بهدف رمضان صبحي لاعب ستوك سيتي الإنجليزي في ذلك الوقت.
وساهم صلاح بشدة في وصول منتخب بلاده إلى نهائي كأس الأمم الإفريقية 2017 وحصوله على المركز الثاني حيث ساهم في أربعة أهداف من أصل خمسة أحرزهم منتخب مصر في البطولة؛ حيث أحرز هدفين يُعدان من أجمل أهداف البطولة الأول في مرمى غانا في دور المجموعات في مباراة فازت بها مصر 1–0 والثاني في مرمى بوركينا فاسو في نصف النهائي في مباراة انتهت بفوز مصر عن طريق ركلات الترجيح 4–3 بعد التعادل في الوقت الأصلي 1–1، كما قام بصناعة هدفين في البطولة أحدهما أحرزه عبد الله السعيد لاعب النادي الأهلي المصري في مرمى أوغندا في دور المجموعات حيث فازت مصر1–0 والآخر أحرزه محمد النني لاعب نادي أرسنال الإنجليزي في مرمى الكاميرون في المباراة النهائية التي انتهت بفوز الكاميرون 2–1 وتم اختيار صلاح في التشكيلة المثالية لهذه البطولة بواسطة كل من الاتحاد الإفريقي وجريدة فرانس فوتبول.

ويعد أهم إنجازات صلاح مع منتخب بلاده هو قيادته له إلى كأس العالم 2018 في روسيا بعد غياب دام لست نسخ متتالية عن البطولة منذ كأس العالم 1990 حيث أحرز صلاح هدفين في مباراة الكونغو التي فازت بها مصر 2–1 وضمنت بها التأهل لكأس العالم قبل جولة واحدة من نهاية التصفيات الإفريقية المؤهلة للبطولة وتم اختياره بواسطة مجلة فرانس فوتبول ضمن التشكيل المثالي لهذه الجولة من تصفيات كأس العالم 2018 ليكون اللاعب العربي والإفريقي الوحيد الذي يتواجد بها بجانب العديد من نجوم الكرة العالمية مثل ليونيل ميسي وروبرت ليفاندوفسكي، وأحرز صلاح خمسة أهداف في التصفيات كاملةً ليصبح هدافًا لها للمرة الثانية علي التوالي بعد التصفيات المؤهلة لكأس العالم 2014.

وفي كأس العالم 2018 أحرز صلاح أول أهداف بلاده في البطولة أمام روسيا من ضربة جزاء في مباراة خسر فيها صلاح ورفاقه بنتيجة 3–1، ليكون صلاح ثالث لاعب مصري عبر التاريخ يسجل هدفًا في كأس العالم بعد عبد الرحمن فوزي الذي سجل هدفين في مرمى المجر في كأس العالم 1934، ومجدي عبد الغني صاحب هدف مصر في مرمى هولندا في كأس العالم 1990. كما نجح صلاح في إحراز ثاني أهداف منتخب بلاده في البطولة في مرمى السعودية في مباراة انتهت بهزيمة مصر بنتيجة 2–1 وفاز صلاح بجائزة أفضل لاعب في هذه المباراة.
""",style:TextStyle(height: 2.1,color: Colors.white,fontSize: 16,fontWeight: FontWeight.w300),),),
                   
                   ],

                ),
                ),
        ),
        );
  }
}