import 'package:flutter/material.dart';

class outfootball extends StatelessWidget {
  const outfootball({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text(
          "خارج الملاعب والجوائز الخارجية",
          style: TextStyle(
            color: Colors.red,
            fontSize: 15,
            fontWeight: FontWeight.bold,
          ),
        ),
        centerTitle: true,
        backgroundColor: Colors.black,
        elevation: 20,
        shadowColor: Colors.black,
      ),
      body: Container(
        width: double.infinity,
        height: double.infinity,
        color: Colors.black,
        child: SingleChildScrollView(
          child: Column(
            children: [
              const SizedBox(height: 20),
              SizedBox(
                width: double.infinity,
                height: 300,
                child: Image.asset("images/Salah_Graffiti_in_Cairo.jpg", fit: BoxFit.cover),
              ),
              const SizedBox(height: 20),
              const Padding(
                padding: EdgeInsets.all(16.0),
                child: Directionality(
                  textDirection: TextDirection.rtl,
                  child: Text(
                    """خارج كرة القدم
الرعاية
لدى صلاح صفقة رعاية مع شركة أديداس للملابس والمعدات الرياضية: فهو يرتدي حذاء كرة القدم Adidas X18. ظهر في إعلان تجاري لشركة Adidas لكأس العالم 2018 إلى جانب لاعبين آخرين في مجموعة Adidas، بما في ذلك ديفيد بيكهام، وليونيل ميسي، وبول بوجبا، والمغني فاريل ويليامز.

وفي مارس 2018، ظهر صلاح في إعلان لشركة فودافون مصر. صُوِّر الفيديو وهو يزور العديد من معالم مرزيسايد، وتم إصدار الفيديو في الأصل باللغة العربية (ولكن تُرجِم أيضًا إلى الإنجليزية). وبعد شهر، ذكر أنه تعرض لـ"الإهانة" بعد عرض صورته عبر طائرة المنتخب الوطني دون إذنه قبل انطلاق كأس العالم في ذلك العام، باعتبار أن الراعي الرسمي للمنتخب شركة WE المنافسة للشركة الراعية له.

التبرعات
من المعروف عن محمد صلاح مساهمته في الكثير من أعمال الخير، حيث تبرع لجمعية اللاعبين القدامى حيث أوصل رغبته بالتبرع للجمعية وتمويلها لسد احتياجاتهم كخطوة إيجابية من اللاعب بها وفاء لرموز الكرة المصرية، كما أعلن محافظ الغربية عن تبرع محمد صلاح لإنشاء معهد ديني حيث وضع مبلغ 8 ملايين جنيه لبناء المعهد الأزهري ووحدة حضانات ووحدة تنفس صناعي بقرية نجريج مسقط رأسه، وقام محمد صلاح بالتبرع لإنشاء قسم خاص للحضانات بمستشفى نجريج مسقط رأسه وذلك بعد وفاة عدد كبير من الأطفال بسبب عدم كفاية الحضانات حيث أبلغه طبيب صديقه بتلك الأزمة ولم يتردد اللاعب وسعى لحل تلك الأزمة بكافة مساعيه، وقام أيضاً بالتبرع لتطوير مدرسته التي تخرج فيها في مرحلة الطفولة عن طريق تغطية الفناء بالرمال حفاظًا على حياة الأطفال الذين يدرسون بالمدرسة، وتبرع لإنشاء وحدة للغسيل الكلوي بقريته لعلاج المرضى من أجل تسهيل التكاليف عليهم ومساعدتهم للشفاء من ذلك المرض والوقوف بجوارهم، وحرص محمد صلاح على تحمل تكاليف إنشاء وحدة استقبال لحالات الطوارئ في مستشفى بسيون التابع لمحافظة الغربية، خاصة بعد شكوى أهالي بلدته من تدهور الحالات الصحية، لعدم وجود وحدة استقبال في المستشفى، فضلاً عن إنشائه غرفة عمليات مجهزة على أكمل وجه في المستشفى بأحدث الأجهزة المستوردة من الخارج، كما قام بالتبرع بمبلغ 5 ملايين من الجنيهات لصندوق تحيا مصر لتدعيم الاقتصاد المصري، وعند تبرعه قام بمقابلة رئيس الجمهورية المصري عبد الفتاح السيسي والتقاط صورة تذكارية معه ومع وزير الشباب والرياضة خالد عبد العزيز. وفي أغسطس 2019، ذكرت تقارير صحفية تبرع صلاح بمبلغ 3 ملايين دولار من أجل إعادة ترميم معهد الأورام بمصر الذي أصابته أضرار بالغة، جراء انفجار أسفر عن وفاة 17 مواطنًا مصريًا.

في 13 أغسطس 2022، اندلع حريق في كنيسة أبو سيفين في الجيزة، مصر، أودى بحياة 41 شخصًا نتيجة لذلك. وأعرب صلاح بعد ذلك عن تعازيه على تويتر، وتبرع بمبلغ ثلاثة ملايين جنيه مصري للمساعدة في إعادة بناء الكنيسة.

الإعلانات
قام محمد صلاح بتصوير عدد من الإعلانات تحت إشراف صندوق مكافحة وعلاج الإدمان والتعاطي المصري، وكان الهدف من تلك الإعلانات مكافحة تعاطي وإدمان المخدرات وتوعية الشباب بخطورتها عليهم وأثرها السيئ على حياتهم، وقام صلاح بتصوير تلك الإعلانات بالمجان وكان شعار الإعلانات «أنت أقوى من المخدرات».
""",   style: TextStyle(color: Colors.white, fontSize: 18),
                  ),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}