import 'package:flutter/material.dart';

class roma extends StatelessWidget {
  const roma({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text(
          "خارج الملاعب والجوائز الخارجية",
          style: TextStyle(
            color: Colors.red,
            fontSize: 15,
            fontWeight: FontWeight.bold,
          ),
        ),
        centerTitle: true,
        backgroundColor: Colors.black,
        elevation: 20,
        shadowColor: Colors.black,
      ),
      body: Container(
        width: double.infinity,
        height: double.infinity,
        color: Colors.black,
        child: SingleChildScrollView(
          child: Column(
            children: [
              const SizedBox(height: 20),
              SizedBox(
                width: double.infinity,
                height: 300,
                child: Image.asset("images/81945.webp", fit: BoxFit.cover),
              ),
              const SizedBox(height: 20),
              const Padding(
                padding: EdgeInsets.all(16.0),
                child: Directionality(
                  textDirection: TextDirection.rtl,
                  child: Text("""روما
موسم 2015–16 (إعارة)
ومع مطلع الموسم الكروي 2015–16 وتحديداً يوم 6 أغسطس 2015 انضم محمد صلاح إلى نادي روما الإيطالي على سبيل الإعارة قادماً من نادي تشيلسي لمدة عام واحد مع أحقية نادي روما في الشراء في المستقبل وذلك مقابل 5 ملايين يورو، وقدم نادي فيورنتينا شكوى إلى الاتحاد الدولي لكرة القدم ضد نادي تشيلسي ومحمد صلاح بداعي أن نادي تشيلسي انتهك عقده مع فيورنتينا عندما سمح لصلاح بالانضمام إلى روما وصدر الحكم بعد ذلك بعد انضمام صلاح إلى ليفربول وجاء في مصلحة صلاح وتشيلسي.

وبدأ صلاح موسمه بالتعادل 1–1 أمام هيلاس فيرونا، وفي 20 سبتمبر 2015 سجل صلاح هدفه الأول من الموسم ضد ساسولو لمساعدة روما على اقتناص نقطة حيث انتهت المباراة بالتعادل 2–2، وسجل في المباراتين التاليتين واللتين جاءتا على النحو التالي: الخسارة ضد سامبدوريا 2–1  والفوز ضد كاربي 5–1، وفي 25 أكتوبر 2015 عاد صلاح إلى ملعب أرتيميو فرانتشي ملعب ناديه السابق فيورنتينا، وسجل ضد فريقه السابق فيورنتينا لمساعدة روما في الفوز بالمباراة الرابعة على التوالي الدوري الإيطالي وفي نهاية الموسم حصل صلاح على جائزة لاعب الموسم في روما، بسبب موسمه الأول الممتاز حيث استطاع تسجيل 14 هدف في الدوري الممتاز الإيطالي أصبح بهم هداف فريقه وشارك في دوري أبطال أوروبا، وأحرز هدفاً وحيداً به وبذلك أحرز 15 هدف في الموسم، كما صنع ستة أهداف، ولعب صلاح أيضاً أمام الأندية الأوروبية الكبرى مثل نادي برشلونة ونادي ريال مدريد الإسبانيين وأحرز أهدافاً في بعضهم وأصبح أحد اللاعبين المهمين في فريق روما.

موسم 2016–17
وفي 3 أغسطس 2016 قام روما بشراء محمد صلاح من تشيلسي مقابل 15 مليون يورو، وكان موسم 2016–17 من أفضل مواسم صلاح حيث استطاع إحراز 19 هدف في الموسم منهم 15 في الدوري الإيطالي وهدفان في كأس إيطاليا وهدفان في الدوري الأوروبي في مرمى نادي ليون الفرنسي وبذلك احتل المركز الثاني في قائمة هدافي ناديه بعد إيدين دجيكوالذي نجح في إحراز 39 هدف في الموسم منهم 29 في الدوري الإيطالي و2 في كأس إيطاليا و8 في الدوري الأوروبي، كما قام بصناعة الأهداف حيث صنع 11 هدف لزملائه في الدوري الإيطالي معظمها لإيدين دجيكو وشكل معه ثنائياً وبذلك احتل صلاح المركز الثاني في الدوري الإيطالي في صناعة الأهداف بعد مهاجم نابولي خوسيه كاييخون الذي نجح في صناعة 12 هدف بفارق هدف واحد عن محمد صلاح، ويعد صلاح أكثر لاعبي روما في الموسم تشكيلاً للفرص على المرمى بحوالي 80 فرصة وثاني أكثر لاعب تسديداً على المرمى ب64 تسديده بعد إيدين دجيكو صاحب ال160 تسديده على المرمى كما سجل أول هاتريك له مع روما في فوزه على بولونيا بنتيجة 3–0 وذلك في 6 نوفمبر 2016 ولذلك اختير صلاح كأفضل لاعب في روما في الدوري الإيطالي موسم 2016–17.


""",
                    style: TextStyle(color: Colors.white, fontSize: 18),
                  ),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}